Revit 2026 API

# BRepBuilderOutcome Enumeration

---

This class defines possible outcomes returned by BRepBuilder functions that need to report outcome via a return value.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum BRepBuilderOutcome
```
```vb
Public Enumeration BRepBuilderOutcome
```
```cpp
public enum class BRepBuilderOutcome
```
```fsharp
type BRepBuilderOutcome
```

| Member name | Value | Description |
| --- | --- | --- |
| Failure | 1 | Unspecified failure. BRepBuilder object is in invalid state and should not be used. |
| Success | 0 | The function has completed successfully. |

#### Reference

Autodesk.Revit.DB Namespace